Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.addToLibrary.subtitle
source: Select one or more starred repositories that are not in the knowledge base yet.
ar: حدد مستودعًا واحدًا أو أكثر مميزًا بنجمة وغير موجود في قاعدة المعرفة بعد.
de: Wähle ein oder mehrere gestarnte Repositories aus, die noch nicht in der Wissensdatenbank sind.
es: Seleccione uno o más repositorios marcados con estrella que aún no estén en la base de conocimiento.
fr: Sélectionnez un ou plusieurs dépôts avec une étoile qui ne sont pas encore dans la base de connaissances.
id: Pilih satu atau lebih repositori yang diberi bintang yang belum ada di basis pengetahuan.
it: Seleziona uno o più repository con stella non ancora presenti nella knowledge base.
ja: まだナレッジベースにないスター付きリポジトリを1つ以上選択してください。
ko: 아직 지식 베이스에 없는 Star한 저장소를 하나 이상 선택하세요.
nl: Selecteer een of meer gemarkeerde repositories die nog niet in de kennisbank staan.
pl: Wybierz jedno lub więcej oznaczonych gwiazdką repozytoriów, które nie są jeszcze w bazie wiedzy.
pt_br: Selecione um ou mais repositórios com estrela que ainda não estão na base de conhecimento.
ru: Выберите один или несколько отмеченных репозиториев, которых ещё нет в базе знаний.
tr: Henüz bilgi tabanında olmayan bir veya daha fazla yıldızlanmış depo seçin.
uk: Виберіть один або кілька позначених зіркою репозиторіїв, яких ще немає в базі знань.
vi: Chọn một hoặc nhiều kho lưu trữ đã star chưa có trong cơ sở tri thức.
zh_hans: 多选尚未入库的 Stars，确认后加入知识库并自动建立索引。
zh_hant: 多选尚未入库的 Stars，确认后加入知识库并自动建立索引。

# rag.workspace.addToLibrary.title
source: Add to Knowledge Base
ar: إضافة إلى قاعدة المعرفة
de: Zur Wissensdatenbank hinzufügen
es: Añadir a la base de conocimiento
fr: Ajouter à la base de connaissances
id: Tambah ke Basis Pengetahuan
it: Aggiungi alla Knowledge Base
ja: ナレッジベースに追加
ko: 지식 베이스에 추가
nl: Toevoegen aan kennisbank
pl: Dodaj do bazy wiedzy
pt_br: Adicionar à Base de Conhecimento
ru: Добавить в базу знаний
tr: Bilgi Tabanına Ekle
uk: Додати до бази знань
vi: Thêm vào Cơ sở tri thức
zh_hans: 添加项目到知识库
zh_hant: 添加项目到知识库

# rag.workspace.answer.copy
source: Copy answer
ar: نسخ الإجابة
de: Antwort kopieren
es: Copiar respuesta
fr: Copier la réponse
id: Salin jawaban
it: Copia risposta
ja: 回答をコピー
ko: 답변 복사
nl: Antwoord kopiëren
pl: Kopiuj odpowiedź
pt_br: Copiar resposta
ru: Копировать ответ
tr: Yanıtı kopyala
uk: Копіювати відповідь
vi: Sao chép câu trả lời
zh_hans: 复制回答
zh_hant: 复制回答

# rag.workspace.answer.export
source: Export Markdown
ar: تصدير Markdown
de: Als Markdown exportieren
es: Exportar Markdown
fr: Exporter en Markdown
id: Ekspor Markdown
it: Esporta Markdown
ja: Markdownをエクスポート
ko: Markdown 내보내기
nl: Exporteren als Markdown
pl: Eksportuj Markdown
pt_br: Exportar Markdown
ru: Экспорт в Markdown
tr: Markdown olarak dışa aktar
uk: Експортувати Markdown
vi: Xuất Markdown
zh_hans: 导出 Markdown
zh_hant: 导出 Markdown

# rag.workspace.citations.collapse
source: Show less
ar: عرض أقل
de: Weniger anzeigen
es: Mostrar menos
fr: Afficher moins
id: Tampilkan lebih sedikit
it: Mostra meno
ja: 表示を減らす
ko: 간략히 보기
nl: Minder weergeven
pl: Pokaż mniej
pt_br: Mostrar menos
ru: Свернуть
tr: Daha az göster
uk: Показати менше
vi: Thu gọn
zh_hans: 收起
zh_hant: 收起

# rag.workspace.citations.moreFormat
source: +%d more
ar: +%d المزيد
de: +%d weitere
es: +%d más
fr: +%d de plus
id: +%d lainnya
it: +%d altri
ja: +%d 件
ko: +%d개 더
nl: +%d meer
pl: +%d więcej
pt_br: +%d mais
ru: Ещё +%d
tr: +%d daha
uk: +%d ще
vi: +%d nữa
zh_hans: 还有 %d 个
zh_hant: 还有 %d 个

# rag.workspace.code.copy
source: Copy code
ar: نسخ الكود
de: Code kopieren
es: Copiar código
fr: Copier le code
id: Salin kode
it: Copia codice
ja: コードをコピー
ko: 코드 복사
nl: Code kopiëren
pl: Kopiuj kod
pt_br: Copiar código
ru: Копировать код
tr: Kodu kopyala
uk: Копіювати код
vi: Sao chép mã
zh_hans: 复制代码
zh_hant: 复制代码

# rag.workspace.composer.attach
source: Add attachment
ar: إضافة مرفق
de: Anhang hinzufügen
es: Añadir adjunto
fr: Ajouter une pièce jointe
id: Tambah lampiran
it: Aggiungi allegato
ja: 添付ファイルを追加
ko: 첨부 파일 추가
nl: Bijlage toevoegen
pl: Dodaj załącznik
pt_br: Adicionar anexo
ru: Добавить вложение
tr: Ek dosya ekle
uk: Додати вкладення
vi: Thêm tệp đính kèm
zh_hans: 添加附件
zh_hant: 添加附件

# rag.workspace.composer.cancel
source: Stop generating
ar: إيقاف التوليد
de: Generieren stoppen
es: Detener generación
fr: Arrêter la génération
id: Hentikan pembuatan
it: Interrompi generazione
ja: 生成を停止
ko: 생성 중단
nl: Genereren stoppen
pl: Zatrzymaj generowanie
pt_br: Parar geração
ru: Остановить генерацию
tr: Oluşturmayı durdur
uk: Зупинити генерацію
vi: Dừng tạo
zh_hans: 停止生成
zh_hant: 停止生成

# rag.workspace.composer.clearContext
source: Clear all attachments and repositories
ar: مسح جميع المرفقات والمستودعات
de: Alle Anhänge und Repositories entfernen
es: Limpiar todos los adjuntos y repositorios
fr: Effacer toutes les pièces jointes et dépôts
id: Hapus semua lampiran dan repositori
it: Cancella tutti gli allegati e repository
ja: すべての添付ファイルとリポジトリをクリア
ko: 모든 첨부 파일 및 저장소 지우기
nl: Alle bijlagen en repositories wissen
pl: Wyczyść wszystkie załączniki i repozytoria
pt_br: Limpar todos os anexos e repositórios
ru: Очистить все вложения и репозитории
tr: Tüm ekleri ve depoları temizle
uk: Очистити всі вкладення та репозиторії
vi: Xóa tất cả tệp đính kèm và kho lưu trữ
zh_hans: 清空全部附件与仓库
zh_hant: 清空全部附件与仓库

# rag.workspace.composer.contextDisclosure
source: Selected context
ar: السياق المحدد
de: Ausgewählter Kontext
es: Contexto seleccionado
fr: Contexte sélectionné
id: Konteks yang dipilih
it: Contesto selezionato
ja: 選択中のコンテキスト
ko: 선택한 컨텍스트
nl: Geselecteerde context
pl: Wybrany kontekst
pt_br: Contexto selecionado
ru: Выбранный контекст
tr: Seçili bağlam
uk: Вибраний контекст
vi: Ngữ cảnh đã chọn
zh_hans: 已选择的上下文
zh_hant: 已选择的上下文

# rag.workspace.composer.deepThinking.off
source: Enable deep thinking with project code
ar: تفعيل التفكير العميق مع كود المشروع
de: Tiefes Denken mit Projektcode aktivieren
es: Activar pensamiento profundo con código del proyecto
fr: Activer la réflexion approfondie avec le code du projet
id: Aktifkan pemikiran mendalam dengan kode proyek
it: Attiva pensiero profondo con il codice del progetto
ja: プロジェクトコードで深い思考を有効にする
ko: 프로젝트 코드로 심층 사고 활성화
nl: Diep nadenken met projectcode inschakelen
pl: Włącz głębokie myślenie z kodem projektu
pt_br: Ativar pensamento profundo com código do projeto
ru: Включить глубокое мышление с кодом проекта
tr: Proje koduyla derin düşünmeyi etkinleştir
uk: Увімкнути глибоке мислення з кодом проєкту
vi: Bật suy luận sâu với mã dự án
zh_hans: 开启深度思考并读取项目代码
zh_hant: 开启深度思考并读取项目代码

# rag.workspace.composer.deepThinking.on
source: Disable deep thinking
ar: تعطيل التفكير العميق
de: Tiefes Denken deaktivieren
es: Desactivar pensamiento profundo
fr: Désactiver la réflexion approfondie
id: Nonaktifkan pemikiran mendalam
it: Disattiva pensiero profondo
ja: 深い思考を無効にする
ko: 심층 사고 비활성화
nl: Diep nadenken uitschakelen
pl: Wyłącz głębokie myślenie
pt_br: Desativar pensamento profundo
ru: Отключить глубокое мышление
tr: Derin düşünmeyi devre dışı bırak
uk: Вимкнути глибоке мислення
vi: Tắt suy luận sâu
zh_hans: 关闭深度思考
zh_hant: 关闭深度思考

# rag.workspace.composer.deepThinking.singleRepoRequired
source: Deep thinking requires exactly one selected project
ar: يتطلب التفكير العميق مشروعًا واحدًا محددًا بالضبط
de: Tiefes Denken erfordert genau ein ausgewähltes Projekt
es: El pensamiento profundo requiere exactamente un proyecto seleccionado
fr: La réflexion approfondie nécessite exactement un projet sélectionné
id: Pemikiran mendalam memerlukan tepat satu proyek yang dipilih
it: Il pensiero profondo richiede esattamente un progetto selezionato
ja: 深い思考にはプロジェクトが1つだけ選択されている必要があります
ko: 심층 사고를 사용하려면 정확히 하나의 프로젝트를 선택해야 합니다
nl: Diep nadenken vereist precies één geselecteerd project
pl: Głębokie myślenie wymaga dokładnie jednego wybranego projektu
pt_br: O pensamento profundo requer exatamente um projeto selecionado
ru: Для глубокого мышления требуется ровно один выбранный проект
tr: Derin düşünme tam olarak bir seçili proje gerektirir
uk: Для глибокого мислення потрібен рівно один вибраний проєкт
vi: Suy luận sâu yêu cầu chính xác một dự án đã chọn
zh_hans: 深度思考只能在选中单个项目时开启
zh_hant: 深度思考只能在选中单个项目时开启

# rag.workspace.composer.model
source: Model: GPT-4.1
ar: النموذج: GPT-4.1
de: Modell: GPT-4.1
es: Modelo: GPT-4.1
fr: Modèle : GPT-4.1
it: Modello: GPT-4.1
ja: モデル: GPT-4.1
ko: 모델: GPT-4.1
pt_br: Modelo: GPT-4.1
ru: Модель: GPT-4.1
uk: Модель: GPT-4.1
vi: Mô hình: GPT-4.1
zh_hans: 模型：GPT-4.1
zh_hant: 模型：GPT-4.1

# rag.workspace.composer.placeholder.commandSend
source: Ask your knowledge base · Type @ to select repositories · ⌘↩ to send
ar: اسأل قاعدة معارفك · اكتب @ لتحديد المستودعات · ⌘↩ للإرسال
de: Frage deine Wissensdatenbank · Gib @ ein, um Repositories auszuwählen · ⌘↩ zum Senden
es: Pregunte a su base de conocimiento · Escriba @ para seleccionar repositorios · ⌘↩ para enviar
fr: Interrogez votre base de connaissances · Tapez @ pour sélectionner des dépôts · ⌘↩ pour envoyer
id: Tanyakan basis pengetahuan Anda · Ketik @ untuk memilih repositori · ⌘↩ untuk mengirim
it: Chiedi alla tua knowledge base · Digita @ per selezionare repository · ⌘↩ per inviare
ja: ナレッジベースに質問する · @でリポジトリを選択 · ⌘↩で送信
ko: 지식 베이스에 질문 · @를 입력하여 저장소 선택 · ⌘↩로 전송
nl: Stel een vraag aan je kennisbank · Typ @ om repositories te selecteren · ⌘↩ om te verzenden
pl: Zapytaj swoją bazę wiedzy · Wpisz @, aby wybrać repozytoria · ⌘↩, aby wysłać
pt_br: Pergunte à sua base de conhecimento · Digite @ para selecionar repositórios · ⌘↩ para enviar
ru: Спросите базу знаний · Введите @ для выбора репозиториев · ⌘↩ для отправки
tr: Bilgi tabanına sorun · Depo seçmek için @ yazın · Göndermek için ⌘↩
uk: Запитайте свою базу знань · Введіть @ для вибору репозиторіїв · ⌘↩ для надсилання
vi: Hỏi cơ sở tri thức · Gõ @ để chọn kho lưu trữ · ⌘↩ để gửi
zh_hans: 向知识库提问 · 输入 @ 选择仓库 · ⌘↩ 发送
zh_hant: 向知识库提问 · 输入 @ 选择仓库 · ⌘↩ 发送

# rag.workspace.composer.placeholder.returnSend
source: Ask your knowledge base · Type @ to select repositories · Return to send
ar: اسأل قاعدة معارفك · اكتب @ لتحديد المستودعات · Return للإرسال
de: Frage deine Wissensdatenbank · Gib @ ein, um Repositories auszuwählen · Eingabetaste zum Senden
es: Pregunte a su base de conocimiento · Escriba @ para seleccionar repositorios · Retorno para enviar
fr: Interrogez votre base de connaissances · Tapez @ pour sélectionner des dépôts · Entrée pour envoyer
id: Tanyakan basis pengetahuan Anda · Ketik @ untuk memilih repositori · Return untuk mengirim
it: Chiedi alla tua knowledge base · Digita @ per selezionare repository · Invio per inviare
ja: ナレッジベースに質問 · @でリポジトリを選択 · Returnで送信
ko: 지식 베이스에 질문 · @를 입력하여 저장소 선택 · Return으로 전송
nl: Stel een vraag aan je kennisbank · Typ @ om repositories te selecteren · Return om te verzenden
pl: Zapytaj swoją bazę wiedzy · Wpisz @, aby wybrać repozytoria · Enter, aby wysłać
pt_br: Pergunte à sua base de conhecimento · Digite @ para selecionar repositórios · Return para enviar
ru: Спросите базу знаний · Введите @ для выбора репозиториев · Return для отправки
tr: Bilgi tabanına sorun · Depo seçmek için @ yazın · Göndermek için Return
uk: Запитайте свою базу знань · Введіть @ для вибору репозиторіїв · Enter для надсилання
vi: Hỏi cơ sở tri thức · Gõ @ để chọn kho lưu trữ · Enter để gửi
zh_hans: 向知识库提问 · 输入 @ 选择仓库 · Return 发送
zh_hant: 向知识庫提問 · 輸入 @ 選擇倉庫 · Return 發送

# rag.workspace.composer.scope
source: Scope: Knowledge base
ar: النطاق: قاعدة المعرفة
de: Bereich: Wissensdatenbank
es: Ámbito: Base de conocimiento
fr: Portée : Base de connaissances
id: Lingkup: Basis pengetahuan
it: Ambito: Knowledge base
ja: スコープ: ナレッジベース
ko: 범위: 지식 베이스
nl: Bereik: Kennisbank
pl: Zakres: Baza wiedzy
pt_br: Escopo: Base de conhecimento
ru: Область: База знаний
tr: Kapsam: Bilgi tabanı
uk: Область: База знань
vi: Phạm vi: Cơ sở tri thức
zh_hans: Scope: 知识库
zh_hant: 範圍：知識庫

# rag.workspace.composer.send
source: Send
ar: إرسال
de: Senden
es: Enviar
fr: Envoyer
id: Kirim
it: Invia
ja: 送信
ko: 전송
nl: Verzenden
pl: Wyślij
pt_br: Enviar
ru: Отправить
tr: Gönder
uk: Надіслати
vi: Gửi
zh_hans: 发送
zh_hant: 發送

# rag.workspace.composer.webSearch.off
source: Enable web search
ar: تفعيل البحث على الويب
de: Websuche aktivieren
es: Activar búsqueda web
fr: Activer la recherche web
id: Aktifkan pencarian web
it: Attiva ricerca web
ja: ウェブ検索を有効にする
ko: 웹 검색 활성화
nl: Webzoekopdracht inschakelen
pl: Włącz wyszukiwanie w sieci
pt_br: Ativar pesquisa na web
ru: Включить веб-поиск
tr: Web aramasını etkinleştir
uk: Увімкнути веб-пошук
vi: Bật tìm kiếm web
zh_hans: 开启联网搜索
zh_hant: 開啟聯網搜尋

# rag.workspace.composer.webSearch.on
source: Disable web search
ar: تعطيل البحث على الويب
de: Websuche deaktivieren
es: Desactivar búsqueda web
fr: Désactiver la recherche web
id: Nonaktifkan pencarian web
it: Disattiva ricerca web
ja: ウェブ検索を無効にする
ko: 웹 검색 비활성화
nl: Webzoekopdracht uitschakelen
pl: Wyłącz wyszukiwanie w sieci
pt_br: Desativar pesquisa na web
ru: Отключить веб-поиск
tr: Web aramasını devre dışı bırak
uk: Вимкнути веб-пошук
vi: Tắt tìm kiếm web
zh_hans: 关闭联网搜索
zh_hant: 關閉聯網搜尋

# rag.workspace.context.attachments
source: Attachments
ar: المرفقات
de: Anhänge
es: Adjuntos
fr: Pièces jointes
id: Lampiran
it: Allegati
ja: 添付ファイル
ko: 첨부 파일
nl: Bijlagen
pl: Załączniki
pt_br: Anexos
ru: Вложения
tr: Ekler
uk: Вкладення
vi: Tệp đính kèm
zh_hans: 本轮附件
zh_hant: 本輪附件

# rag.workspace.context.budget.help.compare.budget
source: Context budget (here)
ar: ميزانية السياق (هنا)
de: Kontextbudget (hier)
es: Presupuesto de contexto (aquí)
fr: Budget de contexte (ici)
id: Anggaran konteks (di sini)
it: Budget contesto (qui)
ja: コンテキスト予算（ここ）
ko: 컨텍스트 예산 (여기)
nl: Contextbudget (hier)
pl: Budżet kontekstu (tutaj)
pt_br: Orçamento de contexto (aqui)
ru: Бюджет контекста (здесь)
tr: Bağlam bütçesi (burada)
uk: Бюджет контексту (тут)
vi: Ngân sách ngữ cảnh (tại đây)
zh_hans: 上下文预算（此处）
zh_hant: 上下文預算（此處）

# rag.workspace.context.budget.help.compare.purpose.budget
source: Verify what was actually sent this turn
ar: تحقق مما تم إرساله فعليًا في هذا الدور
de: Überprüfen, was in dieser Runde tatsächlich gesendet wurde
es: Verificar lo que realmente se envió en esta ronda
fr: Vérifier ce qui a été réellement envoyé ce tour
id: Verifikasi apa yang sebenarnya dikirim pada giliran ini
it: Verifica cosa è stato effettivamente inviato in questo turno
ja: このターンで実際に送信された内容を確認
ko: 이번 턴에 실제로 전송된 내용 확인
nl: Controleer wat er daadwerkelijk is verzonden in deze beurt
pl: Sprawdź, co faktycznie zostało wysłane w tej turze
pt_br: Verificar o que foi realmente enviado neste turno
ru: Проверить, что было отправлено в этом раунде
tr: Bu turda gerçekte ne gönderildiğini doğrulayın
uk: Перевірити, що було фактично надіслано в цьому ході
vi: Xác minh những gì thực sự được gửi trong lượt này
zh_hans: 核对本轮实际发送了哪些内容
zh_hant: 核對本輪實際發送了哪些內容

# rag.workspace.context.budget.help.compare.purpose.label
source: Best for
ar: الأنسب لـ
de: Am besten geeignet für
es: Mejor para
fr: Idéal pour
id: Terbaik untuk
it: Ideale per
ja: 最適な用途
ko: 최적 용도
nl: Beste voor
pl: Najlepsze do
pt_br: Ideal para
ru: Лучше всего для
tr: En uygun
uk: Найкраще для
vi: Phù hợp nhất cho
zh_hans: 适用场景
zh_hant: 適用場景

# rag.workspace.context.budget.help.compare.purpose.usage
source: Estimate whether the window will be full before sending
ar: تقدير ما إذا كانت النافذة ستمتلئ قبل الإرسال
de: Abschätzen, ob das Fenster vor dem Senden voll sein wird
es: Estimar si la ventana estará llena antes de enviar
fr: Estimer si la fenêtre sera pleine avant l'envoi
id: Perkirakan apakah jendela akan penuh sebelum mengirim
it: Stima se la finestra sarà piena prima dell'invio
ja: 送信前にウィンドウが満杯になるか推定
ko: 전송 전에 창이 가득 찰지 예측
nl: Schat of het venster vol zal zijn voordat je verzendt
pl: Oszacuj, czy okno będzie pełne przed wysłaniem
pt_br: Estimar se a janela estará cheia antes de enviar
ru: Оценить, будет ли окно заполнено до отправки
tr: Göndermeden önce pencerenin dolup dolmayacağını tahmin edin
uk: Оцінити, чи заповниться вікно перед надсиланням
vi: Ước tính xem cửa sổ có đầy trước khi gửi không
zh_hans: 发送前估算窗口是否会挤满
zh_hant: 發送前估算視窗是否會擠滿

# rag.workspace.context.budget.help.compare.segments.budget
source: Lists reserved output tokens explicitly
ar: يسرد رموز الإخراج المحجوزة بشكل صريح
de: Listet reservierte Ausgabetoken explizit auf
es: Enumera los tokens de salida reservados explícitamente
fr: Liste explicitement les jetons de sortie réservés
id: Mencantumkan token output yang dicadangkan secara eksplisit
it: Elenca esplicitamente i token di output riservati
ja: 予約済み出力トークンを明示的に表示
ko: 예약된 출력 토큰을 명시적으로 나열
nl: Toont gereserveerde uitvoertokens expliciet
pl: Wyraźnie wymienia zarezerwowane tokeny wyjściowe
pt_br: Lista tokens de saída reservados explicitamente
ru: Явно перечисляет зарезервированные выходные токены
tr: Ayrılmış çıktı token'larını açıkça listeler
uk: Явно перераховує зарезервовані вихідні токени
vi: Liệt kê rõ ràng các token đầu ra dự trữ
zh_hans: 单独列出预留输出分片
zh_hant: 單獨列出預留輸出分片

# rag.workspace.context.budget.help.compare.segments.label
source: What you see
ar: ما تراه
de: Was du siehst
es: Lo que ve
fr: Ce que vous voyez
id: Apa yang Anda lihat
it: Cosa vedi
ja: 表示内容
ko: 표시 내용
nl: Wat je ziet
pl: Co widzisz
pt_br: O que você vê
ru: Что вы видите
tr: Gördüğünüz
uk: Що ви бачите
vi: Những gì bạn thấy
zh_hans: 展示内容
zh_hant: 展示內容

# rag.workspace.context.budget.help.compare.segments.usage
source: Shows input segments only; reserved output is hidden but still deducted internally
ar: يظهر مقاطع الإدخال فقط؛ الإخراج المحجوز مخفي لكنه يُخصم داخليًا
de: Zeigt nur Eingabesegmente an; reservierte Ausgabe ist versteckt, wird aber intern abgezogen
es: Muestra solo segmentos de entrada; la salida reservada está oculta pero se deduce internamente
fr: Affiche uniquement les segments d'entrée ; la sortie réservée est masquée mais toujours déduite en interne
id: Menampilkan hanya segmen input; output yang dicadangkan disembunyikan tetapi tetap dikurangkan secara internal
it: Mostra solo i segmenti di input; l'output riservato è nascosto ma comunque dedotto internamente
ja: 入力セグメントのみ表示。予約済み出力は非表示だが内部で差し引かれる
ko: 입력 세그먼트만 표시, 예약된 출력은 숨겨지지만 내부적으로 차감됨
nl: Toont alleen invoersegmenten; gereserveerde uitvoer is verborgen maar wordt intern afgetrokken
pl: Pokazuje tylko segmenty wejściowe; zarezerwowane wyjście jest ukryte, ale wewnętrznie odliczane
pt_br: Mostra apenas segmentos de entrada; a saída reservada fica oculta, mas ainda é deduzida internamente
ru: Показывает только входные сегменты; зарезервированный вывод скрыт, но вычитается внутри
tr: Yalnızca girdi bölümlerini gösterir; ayrılmış çıktı gizlidir ancak dahili olarak düşülür
uk: Показує лише вхідні сегменти; зарезервований вихід прихований, але внутрішньо враховується
vi: Chỉ hiển thị các phân đoạn đầu vào; đầu ra dự trữ bị ẩn nhưng vẫn được khấu trừ nội bộ
zh_hans: 只展示输入分段；预留输出不列出，但仍参与内部扣预算
zh_hant: 只展示輸入分段；預留輸出不列出，但仍參與內部扣預算

# rag.workspace.context.budget.help.compare.timing.budget
source: Replay after this turn finishes planning and retrieval
ar: إعادة التشغيل بعد انتهاء هذا الدور من التخطيط والاسترجاع
de: Wiedergabe, nachdem diese Runde die Planung und den Abruf abgeschlossen hat
es: Reproducir después de que esta ronda termine la planificación y recuperación
fr: Rejouer après que ce tour a terminé la planification et la récupération
id: Putar ulang setelah giliran ini selesai merencanakan dan mengambil
it: Riproduci dopo che questo turno ha completato pianificazione e recupero
ja: このターンの計画と検索完了後に再表示
ko: 이번 턴의 계획 및 검색 완료 후 재생
nl: Herhaal nadat deze beurt planning en ophalen heeft voltooid
pl: Odtwórz po zakończeniu planowania i wyszukiwania w tej turze
pt_br: Reproduzir após este turno terminar o planejamento e a recuperação
ru: Повтор после завершения планирования и извлечения в этом раунде
tr: Bu tur planlama ve getirmeyi tamamladıktan sonra tekrar oynat
uk: Відтворюється після завершення планування та пошуку в цьому ході
vi: Phát lại sau khi lượt này hoàn tất lập kế hoạch và truy xuất
zh_hans: 本轮计划与检索完成后的实际快照
zh_hant: 本輪計劃與檢索完成後的實際快照

# rag.workspace.context.budget.help.compare.timing.label
source: When
ar: متى
de: Wann
es: Cuándo
fr: Quand
id: Kapan
it: Quando
ja: タイミング
ko: 시점
nl: Wanneer
pl: Kiedy
pt_br: Quando
ru: Когда
tr: Zaman
uk: Коли
vi: Khi nào
zh_hans: 出现时机
zh_hant: 出現時機

# rag.workspace.context.budget.help.compare.timing.usage
source: Live preview while typing; shows the last turn when the draft is empty
ar: معاينة مباشرة أثناء الكتابة؛ تظهر الدور الأخير عندما يكون المسودة فارغًا
de: Live-Vorschau während der Eingabe; zeigt die letzte Runde, wenn der Entwurf leer ist
es: Vista previa en vivo mientras escribe; muestra la última ronda cuando el borrador está vacío
fr: Aperçu en direct pendant la saisie ; montre le dernier tour lorsque le brouillon est vide
id: Pratinjau langsung saat mengetik; menampilkan giliran terakhir saat draf kosong
it: Anteprima live durante la digitazione; mostra l'ultimo turno quando la bozza è vuota
ja: 入力中のライブプレビュー。下書きが空の場合は前のターンを表示
ko: 입력 중 실시간 미리보기, 초안이 비어 있으면 마지막 턴 표시
nl: Live voorbeeld tijdens het typen; toont de laatste beurt als het concept leeg is
pl: Podgląd na żywo podczas pisania; pokazuje ostatnią turę, gdy szkic jest pusty
pt_br: Pré-visualização ao vivo enquanto digita; mostra o último turno quando o rascunho está vazio
ru: Предварительный просмотр в реальном времени при вводе; показывает последний раунд, если черновик пуст
tr: Yazarken canlı önizleme; taslak boşken son turu gösterir
uk: Попередній перегляд у реальному часі під час введення; показує останній хід, коли чернетка порожня
vi: Xem trước trực tiếp khi nhập; hiển thị lượt cuối cùng khi bản nháp trống
zh_hans: 输入时实时预览；草稿为空时显示上一轮结果
zh_hant: 輸入時即時預覽；草稿為空時顯示上一輪結果

# rag.workspace.context.budget.help.compare.title
source: Context budget vs. context usage
ar: ميزانية السياق مقابل استخدام السياق
de: Kontextbudget vs. Kontextnutzung
es: Presupuesto de contexto vs. uso de contexto
fr: Budget de contexte vs. utilisation du contexte
id: Anggaran konteks vs. penggunaan konteks
it: Budget contesto vs. utilizzo contesto
ja: コンテキスト予算 vs コンテキスト使用量
ko: 컨텍스트 예산 vs 컨텍스트 사용량
nl: Contextbudget vs. contextgebruik
pl: Budżet kontekstu a użycie kontekstu
pt_br: Orçamento de contexto vs. uso de contexto
ru: Бюджет контекста и использование контекста
tr: Bağlam bütçesi ve bağlam kullanımı
uk: Бюджет контексту проти використання контексту
vi: Ngân sách ngữ cảnh so với mức sử dụng ngữ cảnh
zh_hans: 与「上下文占用」的区别
zh_hant: 與「上下文佔用」的區別

# rag.workspace.context.budget.help.compare.usage
source: Context usage (Composer)
ar: استخدام السياق (المحرر)
de: Kontextnutzung (Composer)
es: Uso de contexto (Compositor)
fr: Utilisation du contexte (Composer)
id: Penggunaan konteks (Komposer)
it: Utilizzo contesto (Compositore)
ja: コンテキスト使用量（Composer）
ko: 컨텍스트 사용량 (컴포저)
nl: Contextgebruik (Composer)
pl: Użycie kontekstu (Kompozytor)
pt_br: Uso de contexto (Compositor)
ru: Использование контекста (Composer)
tr: Bağlam kullanımı (Besteci)
uk: Використання контексту (Композитор)
vi: Mức sử dụng ngữ cảnh (Composer)
zh_hans: 上下文占用（Composer）
zh_hant: 上下文佔用（Composer）
